Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_modbus.c
/**
 * @file bsp_gd32f303xx_modbus.c
 * @author your name (you@domain.com)
 * @brief Modbus软件层
 * @version 0.3
 * @date 2025-04-30
 * 
 * @copyright Copyright (c) 2025
 * 
 */

#include <stddef.h>
#include <stdio.h>
#include "gd32f30x_gpio.h"
#include "gd32f30x_timer.h"
#include "bsp_types.h"
#include "bsp_gd32f303xx_modbus.h"
#include "bsp_gd32f303xx_mbuser.h"
#include "bsp_gd32f303xx_mbboard.h"
#include "bsp_gd32f303xx_systick.h"

/* TODO: 对大小端转换相关的功能块使用内核自带的函数__REV16实现 */
/* FIXME: 缺少对广播地址的响应功能 */
/* FIXME: 需要对出现故障的无法通讯的从机地址打上标记 */

/* 调试用临时头文件 */
#include "bsp_gd32f303xx_jlx192128g.h"

/* private prototype */
static BSP_StatusTypedef vMBSoftInit(BSP_ModbusHandleTypedef *_hModbus, BSP_ModbusModeTypeDef _eMode, BSP_ModbusProtocolTypeDef _eProtocol, BSP_ModbusOperationsTypedef *_eMBOps);

static void vMBSlaveUartTxISR(BSP_ModbusHandleTypedef *_hModbus);
static void vMBSlaveTimISR(BSP_ModbusHandleTypedef *_hModbus);
static void vMBSlaveUartRxISR(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar);
static BSP_ModbusErrorTypeDef eMBSlaveNormalRSP(BSP_ModbusHandleTypedef *_hModbus);
static void vMBSlaveExceptionRSP(BSP_ModbusHandleTypedef *_hModbus);
static void vResetSlaveRxState(BSP_ModbusHandleTypedef *_hModbus);
static BSP_StatusTypedef eCheckRegLen(BSP_ModbusHandleTypedef *_hModbus, uint16_t _usCnt);
static BSP_StatusTypedef eCheckRegAddr(BSP_ModbusHandleTypedef *_hModbus, uint16_t _usAddr);
static BSP_StatusTypedef eCheckCmdCode(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar);
static BSP_ModbusErrorTypeDef eMBSlaveReceive(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar);

static void vMBTCPMasterUartRXISR(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar);

static void vMBMasterUartTxISR(BSP_ModbusHandleTypedef *_hModbus);
static void vMBMasterUartRxISR(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar);
static void vMBMasterTimISR(BSP_ModbusHandleTypedef *_hModbus);
static void vResetMasterState(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef eMBMasterExceptionRSP(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef eMBMasterNormalRSP(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef eMBMasterReceive(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar);

static void vMakeCRC16Table(void);
static uint16_t usCRC16Stream(uint16_t _usLastCRC, uint8_t data);
static BSP_ModbusErrorTypeDef vCmdFun01(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef vCmdFun03(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef vCmdFun05(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef vCmdFun06(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef vCmdFun10(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef eCmdRSP01(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef eCmdRSP03(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef eCmdRSP05(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef eCmdRSP06(BSP_ModbusHandleTypedef *_hModbus);
static BSP_ModbusErrorTypeDef eCmdRSP10(BSP_ModbusHandleTypedef *_hModbus);

/* global config variable */
uint8_t g_pCmdSet[MODBUS_FUNCTIONS_COUNTS] = {
    0x01,
    0x03,
    0x05, 
    0x06, 
    0x10
};

eCmdCallbackTypeDef g_pCmdFunSet[MODBUS_FUNCTIONS_COUNTS] = {
    vCmdFun01, 
    vCmdFun03, 
    vCmdFun05, 
    vCmdFun06, 
    vCmdFun10
};

static eCmdRSPTypeDef g_pCmdRSPSet[MODBUS_FUNCTIONS_COUNTS] = {
    eCmdRSP01,
    eCmdRSP03,
    eCmdRSP05,
    eCmdRSP06, 
    eCmdRSP10
};

/* user config variable extern */
extern uint16_t g_pBaseAddrSet[MODBUS_BASEADDR_COUNTS];
extern uint16_t g_pRegAddrLen[MODBUS_BASEADDR_COUNTS];
extern eBaseAddrCallbackTypeDef g_pBaseAddrFunSet[MODBUS_BASEADDR_COUNTS];

/* global variable */
static uint16_t CRC16LUT[256] = {0};
static uint8_t g_pFrameRxBuffer[256] = {0};   /* TODO: 需优化为链表形式 */
static uint8_t g_pFrameTxBuffer[256] = {0};   /* DMA发送使用数组 */

/**
 * @brief modbus初始化函数
 * 
 * @param _hModbus modbus全局结构体变量
 * @param _eMode MB_MASTER 或 MB_SLAVE
 * @param _ulBaud 波特率设置
 */
void bsp_ModbusInit(BSP_ModbusHandleTypedef *_hModbus, BSP_ModbusModeTypeDef _eMode, BSP_ModbusProtocolTypeDef _eProtocol, uint32_t _ulBaud, BSP_ModbusOperationsTypedef *_eMBOps)
{    
	vMBSoftInit(_hModbus, _eMode, _eProtocol, _eMBOps);
    _hModbus->mb_ops->TimerInit();
    _hModbus->mb_ops->HardwareInit(_ulBaud);
}

static BSP_StatusTypedef vMBSoftInit(BSP_ModbusHandleTypedef *_hModbus, BSP_ModbusModeTypeDef _eMode, BSP_ModbusProtocolTypeDef _eProtocol, BSP_ModbusOperationsTypedef *_eMBOps)
{
    if ((_eMode != MB_MASTER) && (_eMode != MB_SLAVE)) {
        return BSP_ERROR;
    }

    _hModbus->Mode  = _eMode;     // Master or Slave
    if (_hModbus->Mode == MB_SLAVE) {
        _hModbus->SlaveAddr = MODBUS_SLAVE_ADDR;
    } else {
        _hModbus->SlaveAddr = 0;
    }

    _hModbus->Protocol = _eProtocol;

    _hModbus->exe   = 0;      /* 功能码接收完毕后置1，表明函数可执行 */ /* 仅在帧结束的定时器中断中有权限置1 */
    _hModbus->pass  = 0;     /* 忽略当前指令 */ /* 有权限控制该变量的对象为 1. 从地址不匹配； 2. 等待函数执行时接收到字节流 */
    _hModbus->busy  = 0;
    _hModbus->ErrLatch = MODBUS_DEFAULT; /* 当ExecuteLatch初始状态时，默认置位，接收完毕才更改为SUCCESS */
    _hModbus->TimeoutCnt = 0;

    _hModbus->RxCnt = 0;
    if (_hModbus->Protocol == MB_TCP) {
        _hModbus->pcRxBuffer = g_pFrameRxBuffer + 6;    
    } else {
        _hModbus->pcRxBuffer = g_pFrameRxBuffer;
    }
    _hModbus->CRCRx = 0xFFFF;

    _hModbus->CmdLen = MODBUS_FUNCTIONS_COUNTS;
    _hModbus->pcCmd = g_pCmdSet;
    _hModbus->CmdIndex = 0;
    _hModbus->eCmdCallback = g_pCmdFunSet; /* 命令回调指针数组 */
    _hModbus->eCmdRSP = g_pCmdRSPSet;

    _hModbus->BaseAddrCnt = MODBUS_BASEADDR_COUNTS;
    _hModbus->psBaseAddr = g_pBaseAddrSet;   /* 参数地址 */
    _hModbus->BaseAddrIndex = 0;
    _hModbus->psRegAddrLen = g_pRegAddrLen; /* 参数地址对应的最大参数个数 */
    _hModbus->RegAddrOffset = 0;
    _hModbus->eBaseAddrCallback = g_pBaseAddrFunSet; /* 寄存器操作回调指针数组 */

    _hModbus->DataByteLen = 0;
    _hModbus->pcDataBuffer = NULL;

    _hModbus->TxCnt = 0;
    if (_hModbus->Protocol == MB_TCP) {
        _hModbus->pcTxBuffer = g_pFrameTxBuffer + 6;    /* 对TCP发送报文进行报文头位置偏移 */
    } else {
        _hModbus->pcTxBuffer = g_pFrameTxBuffer;
    }

    _hModbus->MsgHeadcnt = 0;
    _hModbus->trans_id = 0;
    _hModbus->pid = 0;  /* modbus tcp 协议描述符 */ 
    _hModbus->msg_len = 0;

    _hModbus->mb_ops = _eMBOps;

    vMakeCRC16Table();

