Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_modbus.c
    return BSP_OK;
}

void bsp_ModbusUartTxIRQCallback(BSP_ModbusHandleTypedef *_hModbus)
{
    if (_hModbus->Mode == MB_MASTER) {
        vMBMasterUartTxISR(_hModbus);
    } else if (_hModbus->Mode == MB_SLAVE) {
        vMBSlaveUartTxISR(_hModbus);
    }
}

void bsp_ModbusUartRxIRQCallback(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar)
{
    if (_hModbus->Mode == MB_MASTER) {
		if (_hModbus->Protocol == MB_TCP) {
			vMBTCPMasterUartRXISR(_hModbus, _ucChar);
		} else {
			vMBMasterUartRxISR(_hModbus, _ucChar);
		}
    } else if (_hModbus->Mode == MB_SLAVE) {
        vMBSlaveUartRxISR(_hModbus, _ucChar);
    }
}

void bsp_ModbusUartTimIRQCallback(BSP_ModbusHandleTypedef *_hModbus)
{
    if (_hModbus->Mode == MB_MASTER) {
        vMBMasterTimISR(_hModbus);
    } else if (_hModbus->Mode == MB_SLAVE) {
        vMBSlaveTimISR(_hModbus);
    }
}

/* ===========================================TCP主机函数=========================================== */
/**
 * @brief modbus tcp不以时间间隔标记帧头帧尾，而是在报文头中声明帧长度
 *        modbus tcp不需要进行CRC校验，但需要对报文头进行核对
 *        追加了TCP协议下的接收中断处理函数，在其中进行了对TCP协议下的报文头部分的处理，并直接在该函数中判断帧结束标志并置位。TODO: 后续可能需要根据TCP协议的帧特性，实现队列形式的命令处理。
 * @param _hModbus 
 */
static void vMBTCPMasterUartRXISR(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar)
{
    static uint16_t usRxReg = 0;
    BSP_ModbusErrorTypeDef eErrorCode = MODBUS_DEFAULT;
    MBTIM_DISABLE();
    MBTIM_LOAD_RST();
    _hModbus->TimeoutCnt = 0;
    if (_hModbus->ErrLatch != MODBUS_ACKERR) {  /* 若接收帧格式错误，忽略后续接收 */
        if (_hModbus->exe) {  /* 若已成功接收到一帧数据但未进行处理，直接返回 */
            return ;
        }
        if (_hModbus->MsgHeadcnt < 6) {
            g_pFrameRxBuffer[_hModbus->MsgHeadcnt] = _ucChar;
            switch (_hModbus->MsgHeadcnt) {
            case 0: usRxReg = (usRxReg<<8) + _ucChar; break;
            case 1: usRxReg = (usRxReg<<8) + _ucChar;
                if ((_hModbus->trans_id - 1) != usRxReg) {
                    _hModbus->ErrLatch = MODBUS_ACKERR;
                }
                break;
            case 2: usRxReg = (usRxReg<<8) + _ucChar; break;
            case 3: usRxReg = (usRxReg<<8) + _ucChar;
                if (_hModbus->pid != usRxReg) {
                    _hModbus->ErrLatch = MODBUS_ACKERR;
                }
                break;
            case 4: usRxReg = (usRxReg<<8) + _ucChar; break;
            case 5: usRxReg = (usRxReg<<8) + _ucChar;
                _hModbus->msg_len = usRxReg;
                break;
            default:
                break;
            }
            _hModbus->MsgHeadcnt++;
            MBTIM_ENABLE();
        } else {    /* 帧结束判断 */
            eErrorCode = eMBMasterReceive(_hModbus, _ucChar);
            if (_hModbus->ErrLatch == MODBUS_DEFAULT && eErrorCode != MODBUS_DEFAULT) {
                _hModbus->ErrLatch = eErrorCode;
            } 
        }
        if (_hModbus->RxCnt < _hModbus->msg_len) {
            MBTIM_ENABLE();
        } else {    /* 完成一帧接收 */
            if (_hModbus->ErrLatch == MODBUS_DEFAULT) {
                _hModbus->ErrLatch = MODBUS_SUCESS;
            }
            MBTIM_LOAD_RST();
            MBTIM_DISABLE();
            _hModbus->exe = 1;
        }
    } else {    /* 当modbus当前帧传输错误，直接执行报文处理 */
        MBTIM_ENABLE(); /* 超时销帧，等待通道清空 */
    }
}
/* ===========================================TCP主机函数=========================================== */

/* ===========================================RTU主机函数=========================================== */
static void vMBMasterUartTxISR(BSP_ModbusHandleTypedef *_hModbus)
{
    MBTIM_DISABLE();    /* 关闭定时器 */
    MBTIM_LOAD_RST();   /* 定时器清零 */
    MBTIM_ENABLE();     /* 开启定时器 */
}

uint32_t mb_tx_tick = 0;
uint32_t mb_tick_cnt = 0;

/**
 * @brief Tim中断时刻，是一次modbus通信的结尾
 *      （TODO: 但在该定时器中断服务中，并没有做到完善，缺陷在于只能供一个句柄使用，后续需要进行进一步的多线程兼容）
 * @param _hModbus 
 */
static void vMBMasterTimISR(BSP_ModbusHandleTypedef *_hModbus)
{
    if ((_hModbus->Protocol == MB_RTU && _hModbus->RxCnt)   /* RTU帧结束标志 */ 
        || (_hModbus->Protocol == MB_TCP && _hModbus->ErrLatch == MODBUS_ACKERR)) {  /* TCP帧格式错误，等待通道空闲 */
        MBTIM_DISABLE();    /* 关闭定时器 */
        MBTIM_LOAD_RST();   /* 定时器清零 */
        
        if (_hModbus->pass) {     /* 忽略当前接收完毕的指令 */
            _hModbus->pass = 0;   /* 忽略并重置pass锁存器 */
            vResetMasterState(_hModbus);
        } else {
            if (_hModbus->CRCRx) {  // CRC的错误优先级最高，报错信息优先
                _hModbus->ErrLatch = MODBUS_ACKERR;
            } else if (_hModbus->ErrLatch == MODBUS_DEFAULT) {
                _hModbus->ErrLatch = MODBUS_SUCESS;
            }
            _hModbus->exe = 1;  /* 执行回应 */
        }
    } else if (_hModbus->Protocol == MB_TCP || !_hModbus->RxCnt) {  /* 丢帧超时计数 */
        /* modbus超时计数，情况1： 在RTU协议下，在规定的超时时间内，若从机未进行任何回复，则超时；情况2：在TCP协议下，在规定的超时时间内，若未完成报文头声明数目字节的接收，则超时 */ 
        _hModbus->TimeoutCnt++;
        if (_hModbus->TimeoutCnt >= MODBUS_RSP_TIMEOUT/10) {
			mb_tick_cnt = bsp_get_systick() - mb_tx_tick;
            MBTIM_DISABLE();    /* 关闭定时器 */
            MBTIM_LOAD_RST();   /* 定时器清零 */

            _hModbus->ErrLatch = MODBUS_NACK;
            _hModbus->exe = 1;  /* 执行回应 */
        }
    }
}

static void vMBMasterUartRxISR(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar)
{
    BSP_ModbusErrorTypeDef eErrorCode = MODBUS_DEFAULT;
    MBTIM_DISABLE();
    MBTIM_LOAD_RST();

    if (_hModbus->ErrLatch != MODBUS_ACKERR) {  /* 若接收帧格式错误，忽略后续接收 */
        _hModbus->CRCRx = usCRC16Stream(_hModbus->CRCRx, _ucChar);  /* CRC字节流校验 */

        eErrorCode = eMBMasterReceive(_hModbus, _ucChar);
        if (eErrorCode != MODBUS_DEFAULT) { /* TODO: 为什么此处不判断_hModbus->ErrLatch是否存在错误应答 */
            _hModbus->ErrLatch = eErrorCode;
        } 
    }

    MBTIM_ENABLE();
}

static BSP_ModbusErrorTypeDef eMBMasterReceive(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar)
{
/* 存储接收状态机序列位置 */
    _hModbus->pcRxBuffer[_hModbus->RxCnt] = _ucChar;   /* 接收字节流 */

    switch (_hModbus->RxCnt++) {
        case 0: {
            if (_hModbus->SlaveAddr != _ucChar) {
                return MODBUS_ACKERR;
            }
            break;
        }
        case 1: {
            /* check validation of cmdcode */
            if (_ucChar & 0x80) {
                if (_hModbus->pcCmd[_hModbus->CmdIndex] != (_ucChar & 0x7F)) {
                    return MODBUS_ACKERR;
                }
                return MODBUS_ERRACK;
            } else if (_hModbus->pcCmd[_hModbus->CmdIndex] != _ucChar) {
                return MODBUS_ACKERR;
            }
            /* save Cmd code */
        } break;
        default : break;
    }

    return MODBUS_DEFAULT;
}

/**
 * @brief 主机命令发送函数
 * 
 * @param _hModbus      modbus句柄
 * @param _ucSlaveAddr  从机地址 
 * @param _ucCmd        0x03 0x06 0x10 0x01 0x05
 * @param _ucRegAddr    指定要读写的从机寄存器地址
 * @param _psData       发送数据时，需传入的u16类型数据数组指针
 * @param _ucDataLen    当命令为写命令时，该参数为发送数据的长度；当命令为读时，该参数为所读数据寄存器的长度
 * @param eErrorCode    判定命令是否被正确执行及被应答
 * @param _pcRxBuf      接收数组指针
 * @param _ucRxLen      接收数组的长度，若长度不为零，则对应命令为读命令；若长度为零，则对应命令为写命令
 * @return BSP_StatusTypedef BSP_BUSY: 通信中; BSP_OK: 通信执行完毕; BSP_ERROR: 通信参数错误
 */
BSP_StatusTypedef bsp_MBMasterTransmitCommand(BSP_ModbusHandleTypedef *_hModbus,
                                                uint8_t _ucSlaveAddr,
                                                uint8_t _ucCmd, 
                                                uint16_t _ucRegAddr, 
                                                uint16_t *_psData, 
                                                uint8_t _ucDataLen, 
                                                BSP_ModbusErrorTypeDef *eErrorCode, 
                                                uint16_t *_pcRxBuf, 
                                                uint8_t *_ucRxLen)
{
    static enum {
        MB_IDLE = 0,
        MB_SEND_CMD,
        MB_WAIT_RSP
    } mb_state = MB_IDLE;
    BSP_StatusTypedef bsp_sta = BSP_BUSY; 
    uint16_t usCRC = 0;

    switch (mb_state) {
    case MB_IDLE:
        if (_hModbus->busy) 
            return BSP_BUSY;

