Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_modbus.c
        if (eCheckCmdCode(_hModbus, _ucCmd) != BSP_OK) 
            return BSP_ERROR;

        _hModbus->SlaveAddr = _ucSlaveAddr;

        if (_ucDataLen) {
            _hModbus->DataByteLen = _ucDataLen*2;
            _hModbus->pcDataBuffer = (uint8_t *) _psData;
        }
        if (_hModbus->Protocol == MB_TCP) { /* 添加MODBUS_TCP专属报文头 */
            g_pFrameTxBuffer[0] = (_hModbus->trans_id>>8) & 0xFF;
            g_pFrameTxBuffer[1] = _hModbus->trans_id & 0xFF;
            g_pFrameTxBuffer[2] = (_hModbus->pid>>8) & 0xFF;
            g_pFrameTxBuffer[3] = _hModbus->pid & 0xFF;
            _hModbus->trans_id++;
        }
        _hModbus->pcTxBuffer[0] = (_ucRegAddr>>8) & 0xFF;
        _hModbus->pcTxBuffer[1] = _ucRegAddr & 0xFF;

        if (_hModbus->eCmdCallback[_hModbus->CmdIndex] != NULL) {
            if (_hModbus->eCmdCallback[_hModbus->CmdIndex](_hModbus)) {
                return BSP_ERROR;
            }
        } else {
            return BSP_ERROR;
        }

        if (_hModbus->Protocol == MB_TCP) { /* 对PDU数据段长度进行计算，并添加至TCP报文头中 */
            _hModbus->msg_len = _hModbus->TxCnt;
            g_pFrameTxBuffer[4] = (_hModbus->msg_len>>8) &0xFF;
            g_pFrameTxBuffer[5] = _hModbus->msg_len & 0xFF;
        } else if (_hModbus->Protocol == MB_RTU) {  /* 向RTU报文中添加CRC校验码 */
            usCRC = bsp_MBCRC16(_hModbus->pcTxBuffer, _hModbus->TxCnt);
            _hModbus->pcTxBuffer[_hModbus->TxCnt++] = usCRC & 0xFF; /* CRC先发送低位，再发送高位 */
            _hModbus->pcTxBuffer[_hModbus->TxCnt++] = (usCRC>>8) & 0xFF; 
        } else if (_hModbus->Protocol == MB_RTU) {
            __NOP();
        }

        mb_state = MB_SEND_CMD;
    case MB_SEND_CMD:
		_hModbus->busy = 1;
        bsp_sta = _hModbus->mb_ops->SendMessage(g_pFrameTxBuffer, _hModbus->TxCnt + 6 * (_hModbus->Protocol == MB_TCP));
        if (bsp_sta != BSP_BUSY) {
            if (bsp_sta == BSP_OK || bsp_sta == BSP_TIMEOUT) {
				
				mb_tx_tick = bsp_get_systick();
				
                MBTIM_DISABLE();    /* 关闭定时器 */
                MBTIM_LOAD_RST();   /* 定时器清零 */
                MBTIM_ENABLE();     /* 开启定时器 */
                mb_state = MB_WAIT_RSP;
                /* 不对发送超时进行处理，使modbus处超时配置为唯一超时标准，避免了超时时间不唯一的问题 */
//            } else if (bsp_sta == BSP_TIMEOUT) {
//                mb_state = MB_IDLE;
//				*eErrorCode = MODBUS_NACK;
//				return BSP_TIMEOUT;
            } else if (bsp_sta == BSP_ERROR) {
                _hModbus->busy = 0;
                mb_state = MB_IDLE;
				return BSP_ERROR;
            }
        }     
        break;
    case MB_WAIT_RSP:
        if (_hModbus->exe) {
            *eErrorCode = MODBUS_SUCESS;
            *_ucRxLen = 0;
            if (!_hModbus->ErrLatch) {
                _hModbus->pcDataBuffer = (uint8_t *) _pcRxBuf;
                _hModbus->ErrLatch = eMBMasterNormalRSP(_hModbus);
            }

            if (_hModbus->ErrLatch) {
                *eErrorCode = eMBMasterExceptionRSP(_hModbus);
            } else {
                *_ucRxLen = _hModbus->DataByteLen/2;
            }
			
            vResetMasterState(_hModbus);
            mb_state = MB_IDLE;

			return BSP_OK;
        }
        break;
    default:
        break;
    }

    return BSP_BUSY;
    
    // if (_hModbus->busy) {
    //     return BSP_BUSY;
    // }

    // if (eCheckCmdCode(_hModbus, _ucCmd) != BSP_OK) {
    //     return BSP_ERROR;
    // }

    // _hModbus->SlaveAddr = _ucSlaveAddr;

    // if (_ucDataLen) {
    //     _hModbus->DataByteLen = _ucDataLen*2;
    //     _hModbus->pcDataBuffer = (uint8_t *) _psData;
    // }
    // if (_hModbus->Protocol == MB_TCP) { /* 添加MODBUS_TCP专属报文头 */
    //     g_pFrameTxBuffer[0] = (_hModbus->trans_id>>8) & 0xFF;
    //     g_pFrameTxBuffer[1] = _hModbus->trans_id & 0xFF;
    //     g_pFrameTxBuffer[2] = (_hModbus->pid>>8) & 0xFF;
    //     g_pFrameTxBuffer[3] = _hModbus->pid & 0xFF;
    //     _hModbus->trans_id++;
    // }
    // _hModbus->pcTxBuffer[0] = (_ucRegAddr>>8) & 0xFF;
    // _hModbus->pcTxBuffer[1] = _ucRegAddr & 0xFF;

    // if (_hModbus->eCmdCallback[_hModbus->CmdIndex] != NULL) {
    //     if (_hModbus->eCmdCallback[_hModbus->CmdIndex](_hModbus)) {
    //         return BSP_ERROR;
    //     }
    // } else {
    //     return BSP_ERROR;
    // }

    // if (_hModbus->Protocol == MB_TCP) { /* 对PDU数据段长度进行计算，并添加至TCP报文头中 */
    //     _hModbus->msg_len = _hModbus->TxCnt;
    //     g_pFrameTxBuffer[4] = (_hModbus->msg_len>>8) &0xFF;
    //     g_pFrameTxBuffer[5] = _hModbus->msg_len & 0xFF;
    //     _hModbus->mb_ops->SendMessage(g_pFrameTxBuffer, _hModbus->TxCnt + 6);
    // } else if (_hModbus->Protocol == MB_RTU) {  /* 向RTU报文中添加CRC校验码 */
    //     usCRC = bsp_MBCRC16(_hModbus->pcTxBuffer, _hModbus->TxCnt);
    //     _hModbus->pcTxBuffer[_hModbus->TxCnt++] = (usCRC>>8) & 0xFF;
    //     _hModbus->pcTxBuffer[_hModbus->TxCnt++] = usCRC & 0xFF; 
    //     _hModbus->mb_ops->SendMessage(_hModbus->pcTxBuffer, _hModbus->TxCnt);
    // } else if (_hModbus->Protocol == MB_RTU) {
    //     __NOP();
    // }

    // _hModbus->busy = 1;
    
    // MBTIM_DISABLE();    /* 关闭定时器 */
    // MBTIM_LOAD_RST();   /* 定时器清零 */
    // MBTIM_ENABLE();     /* 开启定时器 */
    
    // return BSP_OK;
}

/**
 * @brief 主机命令应答接收函数
 * 
 * @param _hModbus 
 * @param _pcRxBuf 接收数组指针
 * @param _ucRxLen 接收数组的长度，若长度不为零，则对应命令为读命令；若长度为零，则对应命令为写命令
 * @return BSP_ModbusErrorTypeDef 判定命令是否被正确执行及被应答
 */
BSP_ModbusErrorTypeDef bsp_MBMasterGetRSP(BSP_ModbusHandleTypedef *_hModbus, uint16_t *_pcRxBuf, uint8_t *_ucRxLen)
{
    BSP_ModbusErrorTypeDef eErrorCode = MODBUS_SUCESS;
	*_ucRxLen = 0;
	
    if (_hModbus->exe == 0) {
        return MODBUS_BUSY;
    }
	
    if (!_hModbus->ErrLatch) {
        _hModbus->pcDataBuffer = (uint8_t *) _pcRxBuf;
        _hModbus->ErrLatch = eMBMasterNormalRSP(_hModbus);
    }

    if (_hModbus->ErrLatch) {
        eErrorCode = eMBMasterExceptionRSP(_hModbus);
    } else {
        *_ucRxLen = _hModbus->DataByteLen/2;
    }

    vResetMasterState(_hModbus);

    return eErrorCode;
}

static BSP_ModbusErrorTypeDef eMBMasterNormalRSP(BSP_ModbusHandleTypedef *_hModbus)
{
    if (_hModbus->eCmdRSP[_hModbus->CmdIndex] != NULL) {
        return (_hModbus->eCmdRSP[_hModbus->CmdIndex](_hModbus));
    }

    return MODBUS_DEFAULT;
}

