Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_modbus.c
static BSP_ModbusErrorTypeDef eMBMasterExceptionRSP(BSP_ModbusHandleTypedef *_hModbus)
{
    if (_hModbus->ErrLatch == MODBUS_ERRACK) {
        if ((_hModbus->Protocol == MB_TCP && _hModbus->RxCnt != 3) || (_hModbus->Protocol == MB_RTU && _hModbus->RxCnt != 5)) {
            return MODBUS_ACKERR;
        } else {
            return ((BSP_ModbusErrorTypeDef) _hModbus->pcRxBuffer[2]);  /* 具体故障信息 */
        }
    } else {
        return _hModbus->ErrLatch;
    }
}

/**
 * @brief modbus句柄复位
 * 
 * @param _hModbus 
 */
static void vResetMasterState(BSP_ModbusHandleTypedef *_hModbus)
{
    _hModbus->busy = 0;
    _hModbus->exe = 0;
    _hModbus->ErrLatch = MODBUS_DEFAULT;
    _hModbus->CRCRx = 0xFFFF;
    _hModbus->RxCnt = 0;
    _hModbus->TimeoutCnt = 0;

    _hModbus->MsgHeadcnt = 0;

    _hModbus->DataByteLen = 0;

    _hModbus->mb_ops->RstTransChan();
}

/* ===========================================主机函数=========================================== */

/* ===========================================中断回调=========================================== */
static void vMBSlaveUartRxISR(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar)  /* Modbus从机接收中断处理函数 */
{
    MBTIM_DISABLE();
    MBTIM_LOAD_RST();

    if (_hModbus->exe) {
        _hModbus->pass = 1;
    }

    if (!_hModbus->pass) {
        _hModbus->CRCRx = usCRC16Stream(_hModbus->CRCRx, _ucChar);  /* CRC字节流校验 */
        if (_hModbus->ErrLatch == MODBUS_DEFAULT) {
            _hModbus->ErrLatch = eMBSlaveReceive(_hModbus, _ucChar);
            if (_hModbus->ErrLatch == MODBUS_PASS) { /* 仅当地址不匹配时 */
                _hModbus->pass = 1;
            }
        }
    }

    MBTIM_ENABLE();
}

static void vMBSlaveUartTxISR(BSP_ModbusHandleTypedef *_hModbus)
{
    
}

static void vMBSlaveTimISR(BSP_ModbusHandleTypedef *_hModbus)     /* 完成一帧指令接收的中断 */
{
    MBTIM_DISABLE();    /* 关闭定时器 */
    MBTIM_LOAD_RST();   /* 定时器清零 */
	
    if (_hModbus->pass) {     /* 忽略当前接收完毕的指令 */
        _hModbus->pass = 0;   /* 忽略并重置pass锁存器 */
        vResetSlaveRxState(_hModbus);
    } else {
        if (_hModbus->CRCRx) {  // CRC的错误优先级最高，报错信息优先
            _hModbus->ErrLatch = MODBUS_ERROR08;
        } else if (_hModbus->ErrLatch == MODBUS_DEFAULT) {
            _hModbus->ErrLatch = MODBUS_SUCESS;
        }
        _hModbus->exe = 1;  /* 执行回应 */
    }
}
/* ===========================================中断回调=========================================== */

/* ===========================================主循环执行=========================================== */
BSP_ModbusErrorTypeDef bsp_MBSlaveFunctionExecute(BSP_ModbusHandleTypedef *_hModbus)
{
    BSP_ModbusErrorTypeDef eErrorCode = MODBUS_SUCESS;

    if (_hModbus->exe == 0) {
        return MODBUS_IDLE;
    }

    if (!_hModbus->ErrLatch) {
        _hModbus->ErrLatch = eMBSlaveNormalRSP(_hModbus); // 在执行功能时检查是否出错
    }

    if (_hModbus->ErrLatch && (_hModbus->ErrLatch != MODBUS_DEFAULT)) {
        eErrorCode = _hModbus->ErrLatch;
        vMBSlaveExceptionRSP(_hModbus);
    }
    
    vResetSlaveRxState(_hModbus);   /* 完成应答之后，复位接收状态 */

    return eErrorCode;
}

static BSP_ModbusErrorTypeDef eMBSlaveNormalRSP(BSP_ModbusHandleTypedef *_hModbus)
{
    BSP_ModbusErrorTypeDef eErrorCode = MODBUS_SUCESS;

    /* 命令执行与报文回复 */
    // 执行命令，并检查命令执行是否出错
    if (_hModbus->eCmdCallback[_hModbus->CmdIndex] != NULL) {
        eErrorCode = _hModbus->eCmdCallback[_hModbus->CmdIndex](_hModbus);
    } else {
        return MODBUS_ERROR0A;
    }
    if (eErrorCode) return eErrorCode;

    /* 执行应答 */
    if (_hModbus->eCmdRSP[_hModbus->CmdIndex] != NULL) {    
        _hModbus->eCmdRSP[_hModbus->CmdIndex](_hModbus);
    } else {
        return MODBUS_ERROR0A;
    }

    /* 清除执行标志，允许接收新的modbus指令 */
    vResetSlaveRxState(_hModbus);

    return MODBUS_SUCESS;
}

static void vMBSlaveExceptionRSP(BSP_ModbusHandleTypedef *_hModbus) 
{
	#define ARRAYSIZE(a) (sizeof(a) / sizeof(*a))
		
    char ucTxBuf[64] = {0};
	uint8_t ucDMATxBuf[5] = {0};
    uint16_t usCRC = 0;

    ucDMATxBuf[0] = MODBUS_SLAVE_ADDR;
    ucDMATxBuf[1] = 0x80 + _hModbus->pcRxBuffer[1];
    ucDMATxBuf[2] = _hModbus->ErrLatch;

    usCRC = bsp_MBCRC16(ucDMATxBuf, 3);
    ucDMATxBuf[3] = usCRC & 0xFF;
    ucDMATxBuf[4] = (usCRC >> 8) & 0xFF;

    // sprintf(ucDMATxBuf, "Modbus Rx Error: ERROR0%X\r\n", _hModbus->ErrLatch);
    // _hModbus->mb_ops->SendMessage(ucDMATxBuf, ARRAYSIZE(ucDMATxBuf));
    _hModbus->mb_ops->SendMessage(ucDMATxBuf, 5);
	
    sprintf(ucTxBuf, "ERROR0%X", _hModbus->ErrLatch);
	bsp_JLXLcdClearLine(12, 2, 0x00);
    bsp_JLXLcdShowString(0, 12, ucTxBuf, 0, 0);
}

static void vResetSlaveRxState(BSP_ModbusHandleTypedef *_hModbus)
{
    // _hModbus->pass = 0;
    _hModbus->RxCnt = 0;
    _hModbus->exe = 0;
    _hModbus->ErrLatch = MODBUS_DEFAULT;
    _hModbus->CRCRx = 0xFFFF;

    _hModbus->DataByteLen = 0;
}
/* ===========================================主循环执行=========================================== */

/* ===========================================接收处理=========================================== */
static BSP_ModbusErrorTypeDef eMBSlaveReceive(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar)
{    
    /* 存储接收状态机序列位置 */
    static uint16_t usRxReg = 0;

    _hModbus->pcRxBuffer[_hModbus->RxCnt] = _ucChar;   /* 接收字节流 */

    switch (_hModbus->RxCnt++) {   // TODO: Switch中的_ulRxCnt变量当前值为多少, 是++之前还是++之后
        case 0: {
            if (MODBUS_SLAVE_ADDR != _ucChar) {
                return MODBUS_PASS;
            }
            break;
        }
        case 1: {
            /* check validation of cmdcode */
            if (eCheckCmdCode(_hModbus, _ucChar) != BSP_OK) {
                return MODBUS_ERROR0A;
            }
            /* save Cmd code */
        } break;
        case 2: usRxReg = (usRxReg << 8) | _ucChar; break;
        case 3: {
            usRxReg = (usRxReg << 8) | _ucChar;
            if (eCheckRegAddr(_hModbus, usRxReg) != BSP_OK) {
                return MODBUS_ERROR02;
            } 
        } break;
        case 4: usRxReg = (usRxReg << 8) | _ucChar; break;
        case 5: {
            usRxReg = (usRxReg << 8) | _ucChar;
            if (eCheckRegLen(_hModbus, usRxReg) != BSP_OK) {
                return MODBUS_ERROR03;
            } 
        } break;
        default : break;
    }

    return MODBUS_DEFAULT;
}

