Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_modbus.c
static BSP_StatusTypedef eCheckCmdCode(BSP_ModbusHandleTypedef *_hModbus, uint8_t _ucChar)
{
    int i = 0;
    for (i = 0; i < _hModbus->CmdLen; i++) {
        if (_ucChar == _hModbus->pcCmd[i]) {
            _hModbus->CmdIndex = i;
            return BSP_OK;
        }
    }
    
    return BSP_ERROR;
}

static BSP_StatusTypedef eCheckRegAddr(BSP_ModbusHandleTypedef *_hModbus, uint16_t _usAddr)
{
    int i, j;
    for (i = 0; i < _hModbus->BaseAddrCnt; i++) {
        for (j = 0; j < _hModbus->psRegAddrLen[i]; j++) {
            if (_usAddr == (_hModbus->psBaseAddr[i] + j)) {
                _hModbus->BaseAddrIndex = i;
                _hModbus->RegAddrOffset = j;
                return BSP_OK;
            }
        }
    }

    return BSP_ERROR;
}

static BSP_StatusTypedef eCheckRegLen(BSP_ModbusHandleTypedef *_hModbus, uint16_t _usCnt)
{   /* XXX: 不同的命令，帧格式不同，如06H写单个数据命令，帧格式中没有参数值 */
    if (_hModbus->pcCmd[_hModbus->CmdIndex] != 0x06) {  /* FIXME: 如何将该判断的耦合性降低，提升命令的兼容性 */
        if ((_hModbus->RegAddrOffset + _usCnt - 1) >= _hModbus->psRegAddrLen[_hModbus->BaseAddrIndex]) {
            return BSP_ERROR;
        }
    }

    return BSP_OK;
}

static void vMakeCRC16Table(void)
{
    #define POLY 0xA001
    uint16_t c;
    int i, j;
    for (i = 0; i < 256; i++) {
        c = i;
        for (j = 0; j < 8; j++) {
            if(c & 0x1) {   // 若最低位为1
                c = (c >> 1) ^ POLY;    // 与生成多项式异或
            } else {
                c = c >> 1;
            }
        }
        CRC16LUT[i] = c;    // 将计算得到的CRC校验码存入表中
    }
}

uint16_t bsp_MBCRC16(uint8_t *data, uint32_t len)
{
    uint16_t usCRC = 0xffff;  
    uint8_t index;
    while (len--) {
        index = (usCRC & 0xff) ^ *(data++);
        usCRC >>= 8;
        usCRC ^= CRC16LUT[index];
    }
    return usCRC;
}

static uint16_t usCRC16Stream(uint16_t _usLastCRC, uint8_t data)
{
    uint8_t index;

    index = (_usLastCRC & 0xff) ^ data;

    return ((_usLastCRC >> 8) ^ CRC16LUT[index]);
}
/* ===========================================接收处理=========================================== */

/* ===========================================命令执行=========================================== */
static BSP_ModbusErrorTypeDef vCmdFun01(BSP_ModbusHandleTypedef *_hModbus)
{
    if (_hModbus->Mode == MB_MASTER) {
        _hModbus->pcTxBuffer[2] = _hModbus->pcTxBuffer[0];
        _hModbus->pcTxBuffer[3] = _hModbus->pcTxBuffer[1];
        _hModbus->pcTxBuffer[0] = _hModbus->SlaveAddr;
        _hModbus->pcTxBuffer[1] = _hModbus->pcCmd[_hModbus->CmdIndex];
        _hModbus->pcTxBuffer[4] = ((_hModbus->DataByteLen/2)>>8) & 0xFF;
        _hModbus->pcTxBuffer[5] = (_hModbus->DataByteLen/2) & 0xFF;
        _hModbus->TxCnt = 6;

        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        /* TODO: SLAVE_CMD_HANDLE */
        __NOP();
    }

    return MODBUS_DEFAULT;
}

static BSP_ModbusErrorTypeDef vCmdFun03(BSP_ModbusHandleTypedef *_hModbus)
{
    if (_hModbus->Mode == MB_MASTER) {
        _hModbus->pcTxBuffer[2] = _hModbus->pcTxBuffer[0];
        _hModbus->pcTxBuffer[3] = _hModbus->pcTxBuffer[1];
        _hModbus->pcTxBuffer[0] = _hModbus->SlaveAddr;
        _hModbus->pcTxBuffer[1] = _hModbus->pcCmd[_hModbus->CmdIndex];
        _hModbus->pcTxBuffer[4] = ((_hModbus->DataByteLen/2)>>8) & 0xFF;
        _hModbus->pcTxBuffer[5] = (_hModbus->DataByteLen/2) & 0xFF;
        _hModbus->TxCnt = 6;

        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        /* 检查报文正确性 */
        if (_hModbus->RxCnt != 8) {
            return MODBUS_ERROR0B;  /* 请求或响应的长度与协议规定不符 */
        }
        
        /* 帧格式合法，执行参数基地址函数回调 */
        _hModbus->DataByteLen = (_hModbus->pcRxBuffer[4]<<8) + _hModbus->pcRxBuffer[5];
        _hModbus->DataByteLen *= 2;
        if (_hModbus->eBaseAddrCallback[_hModbus->BaseAddrIndex] != NULL) {
            return (_hModbus->eBaseAddrCallback[_hModbus->BaseAddrIndex](_hModbus, MB_READREG));
        }

        return MODBUS_ERROR0A;
    }

    return MODBUS_DEFAULT;
}

static BSP_ModbusErrorTypeDef vCmdFun05(BSP_ModbusHandleTypedef *_hModbus)
{
    if (_hModbus->Mode == MB_MASTER) {
        _hModbus->pcTxBuffer[2] = _hModbus->pcTxBuffer[0];
        _hModbus->pcTxBuffer[3] = _hModbus->pcTxBuffer[1];
        _hModbus->pcTxBuffer[0] = _hModbus->SlaveAddr;
        _hModbus->pcTxBuffer[1] = _hModbus->pcCmd[_hModbus->CmdIndex];
        _hModbus->pcTxBuffer[4] = _hModbus->pcDataBuffer[1];
        _hModbus->pcTxBuffer[5] = _hModbus->pcDataBuffer[0];
        _hModbus->TxCnt = 6;

        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        /* TODO: SLAVE_CMD_HANDLE */
        __NOP();
    }

    return MODBUS_DEFAULT;
}

static BSP_ModbusErrorTypeDef vCmdFun06(BSP_ModbusHandleTypedef *_hModbus)
{
    if (_hModbus->Mode == MB_MASTER) {
        _hModbus->pcTxBuffer[2] = _hModbus->pcTxBuffer[0];
        _hModbus->pcTxBuffer[3] = _hModbus->pcTxBuffer[1];
        _hModbus->pcTxBuffer[0] = _hModbus->SlaveAddr;
        _hModbus->pcTxBuffer[1] = _hModbus->pcCmd[_hModbus->CmdIndex];
        _hModbus->pcTxBuffer[4] = _hModbus->pcDataBuffer[1];
        _hModbus->pcTxBuffer[5] = _hModbus->pcDataBuffer[0];
        _hModbus->TxCnt = 6;

        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        /* 检查报文正确性 */
        if (_hModbus->RxCnt != 8) {
            return MODBUS_ERROR0B;  /* 请求或响应的长度与协议规定不符 */
        }

        /* 帧格式合法，执行参数基地址函数回调 */
        _hModbus->DataByteLen = 2;
        _hModbus->pcDataBuffer = _hModbus->pcRxBuffer + 4;
        if (_hModbus->eBaseAddrCallback[_hModbus->BaseAddrIndex] != NULL) {
            return (_hModbus->eBaseAddrCallback[_hModbus->BaseAddrIndex](_hModbus, MB_WRITEREG));
        }

        return MODBUS_ERROR0A;
    }

    return MODBUS_DEFAULT;
}

static BSP_ModbusErrorTypeDef vCmdFun10(BSP_ModbusHandleTypedef *_hModbus)
{
    int i;  /* FIXME： 可以把此处的i换成_hModbus->TxCnt */
	
    if (_hModbus->Mode == MB_MASTER) {
        _hModbus->pcTxBuffer[2] = _hModbus->pcTxBuffer[0];
        _hModbus->pcTxBuffer[3] = _hModbus->pcTxBuffer[1];
        _hModbus->pcTxBuffer[0] = _hModbus->SlaveAddr;
        _hModbus->pcTxBuffer[1] = _hModbus->pcCmd[_hModbus->CmdIndex];
        _hModbus->pcTxBuffer[4] = ((_hModbus->DataByteLen/2)>>8) & 0xFF;
        _hModbus->pcTxBuffer[5] = (_hModbus->DataByteLen/2) & 0xFF;
        _hModbus->pcTxBuffer[6] = _hModbus->DataByteLen;
        for (i = 0; i < _hModbus->DataByteLen/2; i++) {
            _hModbus->pcTxBuffer[7 + 2*i]   = _hModbus->pcDataBuffer[2*i+1];
            _hModbus->pcTxBuffer[7 + 2*i+1] = _hModbus->pcDataBuffer[2*i];
        }
        i = i*2+7;
        _hModbus->TxCnt = i;

        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        /* 检查报文正确性 */
        if (_hModbus->pcRxBuffer[6] % 2) {  // 数据区字节数为奇数
            return MODBUS_ERROR0B;  /* 请求或响应的长度与协议规定不符 */
        } else if (_hModbus->pcRxBuffer[6] != (_hModbus->RxCnt-9)) {    // 检查写命令中，接收到的数据是否与声明的数据区长度匹配
            return MODBUS_ERROR03;  /* 请求的数据区字节与声明长度不符 */
        }

        /* 帧格式合法，执行参数基地址函数回调 */
        _hModbus->DataByteLen = _hModbus->pcRxBuffer[6];
        _hModbus->pcDataBuffer = _hModbus->pcRxBuffer + 7;
        if (_hModbus->eBaseAddrCallback[_hModbus->BaseAddrIndex] != NULL) {
            return (_hModbus->eBaseAddrCallback[_hModbus->BaseAddrIndex](_hModbus, MB_WRITEREG));
        }

        return MODBUS_ERROR0A;
    }
    
    return MODBUS_DEFAULT;
}
/* ===========================================命令执行=========================================== */

