Bai-WL/v1.0.0/Drivers/gd32f303xx_bsp/bsp_gd32f303xx_modbus.c
/* ===========================================命令应答=========================================== */
/* TODO: 从机TCP消息回复需要进行改写 */
static BSP_ModbusErrorTypeDef eCmdRSP01(BSP_ModbusHandleTypedef *_hModbus)
{
    uint32_t i;
    if (_hModbus->Mode == MB_MASTER) {
        if ((_hModbus->RxCnt-5+(_hModbus->CRCRx&2)) != _hModbus->pcRxBuffer[2]) {
            return MODBUS_ACKERR;
        }
        _hModbus->DataByteLen = _hModbus->pcRxBuffer[2];
        for (i = 0; i < _hModbus->DataByteLen; i++) {
            _hModbus->pcDataBuffer[i] = _hModbus->pcRxBuffer[3+i];
        }
        _hModbus->DataByteLen *= 2; /* GetRSP函数传出具体字节数而非数据数量 */
        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        /* TODO: SLAVEHandle */
    }

    return MODBUS_DEFAULT;
}

static BSP_ModbusErrorTypeDef eCmdRSP03(BSP_ModbusHandleTypedef *_hModbus)
{
    /* TODO: 不定长数据进行DMA发送，需要建堆，然后在发送完毕后释放 */
    char ucTxBuf[32] = {0};
    uint16_t usCRC = 0;
    uint32_t i;

    if (_hModbus->Mode == MB_MASTER) {
        if (((_hModbus->RxCnt-5+(_hModbus->CRCRx&2)) != _hModbus->pcRxBuffer[2]) || (_hModbus->pcRxBuffer[2]%2)) {
            return MODBUS_ACKERR;
        }

        _hModbus->DataByteLen = _hModbus->pcRxBuffer[2];
        for (i = 0; i < _hModbus->DataByteLen/2; i++) {
            _hModbus->pcDataBuffer[i*2] = _hModbus->pcRxBuffer[3+ i*2+1];
            _hModbus->pcDataBuffer[i*2+1] = _hModbus->pcRxBuffer[3 + i*2];
        }

        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        _hModbus->pcTxBuffer[0] = MODBUS_SLAVE_ADDR;
        _hModbus->pcTxBuffer[1] = 0x03;

        _hModbus->pcTxBuffer[2] = (uint8_t)_hModbus->DataByteLen;   /* 数据区字节长度 */    
        for (i = 0; i < _hModbus->DataByteLen; i++) {   /* FIXME: 修复了数据发送格式错误的bug */
            _hModbus->pcTxBuffer[i+3] = _hModbus->pcDataBuffer[i];
        }
        i += 3;
        usCRC = bsp_MBCRC16(_hModbus->pcTxBuffer, i);
        _hModbus->pcTxBuffer[i] = usCRC & 0xFF;
        _hModbus->pcTxBuffer[i+1] = (usCRC>>8) & 0xFF;
        i += 2;

        _hModbus->mb_ops->SendMessage(_hModbus->pcTxBuffer, i);

        bsp_JLXLcdClearLine(12, 2, 0x00);
        sprintf(ucTxBuf, "03H + %XH: RxSUCESS", _hModbus->psBaseAddr[_hModbus->BaseAddrIndex] + _hModbus->RegAddrOffset);
        bsp_JLXLcdShowString(0, 12, ucTxBuf, 0, 0);

        return MODBUS_SUCESS;
    }

    return MODBUS_DEFAULT;
}

static BSP_ModbusErrorTypeDef eCmdRSP05(BSP_ModbusHandleTypedef *_hModbus)
{
    uint32_t i;
    if (_hModbus->Mode == MB_MASTER) {
        if ((_hModbus->RxCnt != _hModbus->TxCnt)) {
            return MODBUS_ACKERR;
        }

        for (i = 2; i < _hModbus->RxCnt; i++) {
            if (_hModbus->pcRxBuffer[i] != _hModbus->pcTxBuffer[i]) {
                return MODBUS_ACKERR;
            }
        }
        _hModbus->DataByteLen = 0;
        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        /* TODO: SLAVEHandle */
        __NOP();
    }

    return MODBUS_DEFAULT;
}

static BSP_ModbusErrorTypeDef eCmdRSP06(BSP_ModbusHandleTypedef *_hModbus)
{
	int i;
    char ucTxBuf[32] = {0};
    uint8_t *ucDMATxBuf = _hModbus->pcRxBuffer;

    if (_hModbus->Mode == MB_MASTER) {
        if ((_hModbus->RxCnt != _hModbus->TxCnt)) {
            return MODBUS_ACKERR;
        }

        for (i = 2; i < _hModbus->RxCnt; i++) {
            if (_hModbus->pcRxBuffer[i] != _hModbus->pcTxBuffer[i]) {
                return MODBUS_ACKERR;
            }
        }
        _hModbus->DataByteLen = 0;
        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        _hModbus->mb_ops->SendMessage(ucDMATxBuf, _hModbus->RxCnt);

        bsp_JLXLcdClearLine(12, 2, 0x00);
        sprintf(ucTxBuf, "06H + %XH: RxSUCESS", _hModbus->psBaseAddr[_hModbus->BaseAddrIndex] + _hModbus->RegAddrOffset);
        bsp_JLXLcdShowString(0, 12, ucTxBuf, 0, 0);
        return MODBUS_SUCESS;
    }

    return MODBUS_DEFAULT;
}

static BSP_ModbusErrorTypeDef eCmdRSP10(BSP_ModbusHandleTypedef *_hModbus)
{
    char ucTxBuf[32] = {0};
    uint16_t usCRC = 0;
    uint8_t i;

    if (_hModbus->Mode == MB_MASTER) {
        if (_hModbus->RxCnt != 8 - (_hModbus->CRCRx&2)) {
            return MODBUS_ACKERR;
        }

        for (i = 2; i < 6; i++) {
            if (_hModbus->pcRxBuffer[i] != _hModbus->pcTxBuffer[i]) {
                return MODBUS_ACKERR;
            }
        }
        
        _hModbus->DataByteLen = 0;

        return MODBUS_SUCESS;
    } else if (_hModbus->Mode == MB_SLAVE) {
        for (i = 0; i < 6; i++) {
            _hModbus->pcTxBuffer[i] = _hModbus->pcRxBuffer[i];
        }
        usCRC = bsp_MBCRC16(_hModbus->pcTxBuffer, i);
        _hModbus->pcTxBuffer[i] = usCRC & 0xFF;
        _hModbus->pcTxBuffer[i+1] = (usCRC>>8) & 0xFF;
        i += 2;

        _hModbus->mb_ops->SendMessage(_hModbus->pcTxBuffer, i);

        bsp_JLXLcdClearLine(12, 2, 0x00);
        sprintf(ucTxBuf, "10H + %XH: RxSUCESS", _hModbus->psBaseAddr[_hModbus->BaseAddrIndex] + _hModbus->RegAddrOffset);
        bsp_JLXLcdShowString(0, 12, ucTxBuf, 0, 0);
        return MODBUS_SUCESS;
    }

    return MODBUS_DEFAULT;
}

/* ===========================================命令应答=========================================== */
